Test/Jerome_Test/ManageResourceInventory/IIS/xml/6-1_sit_getAllManagedElementsWithIteratorRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/bw-2" xmlns:it="http://www.tmforum.org/mtop/fmw/xsd/mepit/v1"  xmlns:mep="http://www.tmforum.org/mtop/fmw/xsd/mep/v1" xmlns:mer="http://www.tmforum.org/mtop/mri/xsd/mer/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/mri/xsd/mer/v1 ../xsd/ManagedElementRetrievalMessagesV1-0.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsa:To>http://host:port/ServiceProvider</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/mri/wsdl/mer/v1-0/getAllManagedElementsWithIteratorRequest</wsa:Action>
  </soap:Header>
  <soap:Body>
    <mer:getAllManagedElementsWithIteratorRequest>
      <it:howMany>500</it:howMany>
      <mer:mdName>
        <nam:object>
          <nam:type>mdNm</nam:type>
          <nam:name>string</nam:name>
        </nam:object>
      </mer:mdName>
    </mer:getAllManagedElementsWithIteratorRequest>
  </soap:Body>
</soap:Envelope>
